Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/death_related_benefits/guardians_payments.html.txt.tmx
Source language: en
Languages: ga

source: If you are taking care of an orphan you may get a social welfare payment
ga: Is féidir íocaíocht chaomhnóra a dhéanamh le duine a thugann cúram do dhílleachta

source: It is not necessary to be a legally appointed guardian
ga: Ní gá duit a bheith ceaptha go dlíthiúil mar chaomhnóir

source: You may get such a payment if the orphan lives with you and you are responsible for his or her care
ga: Tabharfar an íocaíocht chaomhnóra duit má chónaíonn an dílleachta leat agus más tusa atá freagrach as breathnú ina d(h)iaidh

source: The payment must benefit the orphan
ga: Ní foláir nó go rachaidh an íocaíocht chun tairbhe an dílleachta

source: If an orphan is attending a full-time education course, is aged between 18 and 22 years of age and is not living with or in the care of a guardian, the payment can be paid directly to the orphan
ga: Is leis an dílleachta féin a dhéanfar an íocaíocht más rud é go bhfuil sé nó sí ag freastal ar chúrsa lánaimseartha oideachais, go bhfuil sé nó sí idir 18 agus 22 bliana d'aois, agus nach bhfuil cónaí air nó uirthi leis an gcaomhnóir nó faoina c(h)úram

source: The payment can be contributory (based on PRSI payments paid by the parent) or non-contributory (based on a means-test)
ga: Féadfaidh an íocaíocht seo a bheith ranníocach agus bunaithe ar na híocaíochtaí ÁSPC a rinne an tuismitheoir, nó féadfaidh siad a bheidh neamh-ranníocach agus ag braith ar thástáil acmhainne

source: You can claim only one of the following:
ga: Ní féidir leat ach ceann amháin díobh seo a leanas a éileamh:

source: • Guardian's Payment (Contributory) previously called Orphan's (Contributory) Allowance
ga: • Íocaíocht Chaomhnóra (Ranníocach) ar a dtugtaí Liúntas Dílleachta (Ranníocach) roimhe seo

source: • Guardian's Payment (Non-Contributory) previously called Orphan's (Non-Contributory) Pension
ga: • Íocaíocht Chaomhnóra (Neamh-Ranníocach) ar a dtugtaí Liúntas Dílleachta (Neamh-Ranníocach) roimhe seo

source: • Death Benefit/Orphan's Pension awarded under the Occupational Injuries Scheme
ga: • Sochar Dílleachta faoi Scéim na Sochar Gortuithe Ceirde

source: You cannot get one of these payments and a Foster Care Allowance together
ga: Ní féidir leat íocaíocht chaomhnóra agus liúntas cúraim altrama a fháil

source: A child is regarded as an orphan if:
ga: Glactar leis go bhfuil leanbh ina dhílleachta:

source: • They are under 18 (or 22 if in full-time education) and
ga: • Má tá sé nó sí faoi bhun 18 (nó faoi 22 má tá sé nó sí i mbun oideachas lánaimseartha)

source: • Both parents are dead, or
ga: • Tá an bheirt thuismitheoirí marbh, nó

source: • One parent is either dead or unknown or has abandoned and failed to provide for the child, and
ga: • Tá tuismitheoir amháin marbh nó ní fios cá bhfuil sé/sí nó tá an leanbh tréigthe aige/aici nó teipthe orthu soláthar a dhéanamh don leanbh, agus

source: • The other parent is unknown or has abandoned and failed to provide for the child
ga: • Ní fios cé hé/hí an tuismitheoir eile nó tá an leanbh tréigthe aige/aici nó teipthe orthu soláthar a dhéanamh don leanbh

source: If either parent or step-parent had worked at any time and paid PRSI for 26 weeks, the orphan is entitled to the Guardian's Payment (Contributory)
ga: Tá an dílleachta i dteideal Íocaíocht Chaomhnóra (Ranníocach) a fháil má d'oibrigh ceachtar dá t(h)uismitheoir uair ar bith agus má tá ranníocaíochtaí ÁSPC déanta aige nó aici ar feadh 26 seachtaine

source: This may be paid for an orphan living in the State or abroad and is not means tested
ga: Is féidir é seo a íoc le dílleachta atá ina c(h)ónaí sa stát nó thar lear agus níl aon tástáil acmhainne i gceist

source: Payment is made to the orphan's guardian up to the child's 18th birthday or 22nd birthday if they are in full-time education
ga: Is leis an gcaomhnóir a dhéantar an íocaíocht go dtí go mbíonn 18 bliana slán ag an leanbh nó go dtí a 22ú breithlá má tá sé nó sí ar chúrsa oideachais lán aimseartha

source: This is a non-contributory payment for orphans who are not entitled to the contributory payment
ga: Is íocaíocht neamh-ranníocach é seo do leanaí nach bhfuil i dteideal íocaíocht ranníocach a fháil

source: The means test for this is based on the orphan's means
ga: Is í acmhainn an linbh a thástáltar don íocaíocht seo

source: Payment is made to their guardian up to the orphan's 18th birthday or 22nd birthday if they are in full-time education
ga: Is leis an gcaomhnóir a dhéantar an íocaíocht go dtí go mbíonn 18 bliana slán ag an leanbh nó go dtí a 22ú breithlá má tá sé nó sí ar chúrsa oideachais lán aimseartha

source: You must be 'habitually resident' in Ireland to qualify for Guardian's Payment (Non-Contributory). Find out more about habitual residence
ga: Ó 1 Bealtaine 2004 i leith ní mór go mbeidh "gnáth-chónaí" ort in Éirinn d'fhonn cáiliú d'Íocaíocht Chaomhnóra (Neamh-Ranníocach) Faigh amach tuilleadh faoi ghnáth-chónaí

source: EU citizens who are employed or self-employed in Ireland will satisfy the habitual residence criteria to qualify for Guardian's Payment (Non-Contributory) under EU Regulations
ga: Ó 5 Bealtaine 2005 sásóidh saoránaigh de chuid an AE atá fostaithe nó féinfhostaithe in Éirinn critéir an ghnáth-chónaithe chun cáiliú don Íocaíocht Chaomhnóra (Neamh-Ranníocach)

source: Death Benefit/Orphan's Pension awarded under the Occupational Injuries Benefit Scheme
ga: Pinsean Dílleachta faoi Scéim na Sochar Gortuithe Ceirde

source: Under the Occupational Injuries Scheme, a slightly higher pension may be payable to the guardian of an orphan if the parent, step-parent or person who was supporting the orphaned child or children:
ga: Is féidir pinsean dílleachtaí beagán níos airde a íoc faoi Scéim na Sochar Gortuithe Ceirde más rud é:

source: • Died as a result of an accident at work
ga: • Go bhfuair an tuismitheoir, an leasthuismitheoir nó an duine atá ag cothú an linbh nó na leanaí bás de thoradh gortaithe ag obair

source: • Died as a result of an occupational disease
ga: • Nó de thoradh galair cheirde

source: • Was getting Disablement Pension assessed at 50% or more at the time of their death
ga: • Go raibh sé nó sí ag fáil Pinsin Mhíchumais ar measadh é a bheith de 50% nó níos mó ag am a b(h)áis

source: This payment is not means tested and there are no specific PRSI requirements (as long as at least one week of PRSI has been paid)
ga: Níl aon tástáil acmhainne i gceist maidir leis an sochar seo, agus níl aon riachtanas ann maidir le híocaíochtaí ÁSPC chomh fada is a rinneadh íocaíocht seachtaine amháin ÁSPC

source: From 17 March 2017, the Guardian's Payment (Contributory) is paid at a standard rate of €176 per week (previously €161 per week) and the maximum Guardian's Payment (Non-Contributory) is €176 per week (previously €161 per week)
ga: Is é €176 (ó 17 Márta 2017) in aghaidh na seachtaine an Íocaíocht Chaomhnóra (Ranníocach)

source: If the orphan’s weekly means are more than €7.60 the Guardian's Payment (Non-Contributory) is reduced by €2.50 for each €2.50 assessed (that is, for each €2.50 or part of €2.50 of means over the amount of €7.60). See SW19 for a table of how an orphan’s means affect a Guardian’s Payment (Non-Contributory)
ga: Is é €176 (ó 17 Márta 2017) in aghaidh na seachtaine an Íocaíocht Chaomhnóra (Neamh-Ranníocach) freisin ach ní mór tástáil acmhainne a dhéanamh le féachaint an bhfaighidh tú an méid iomlán

source: The Death Benefit/Orphan's Pension payable under the Occupation Injuries Scheme is €179.80 from March 2017 (previously €164.80)
ga: Ó Márta 2017 i leith is é €179.80 an pinsean dílleachta atá iníoctha faoin Scéim um Shochar Gortuithe Ceirde

source: Guardian's Payment (Contributory) and Guardian's Payment (Non-Contributory)
ga: Íoslódáil agus comhlánaigh an fhoirm iarratais GP1(pdf)

source: To apply, fill in Form GP1 (pdf). You can also get an application form at every Post Office
ga: Féadfaidh tú foirm iarratais a fháil freisin i ngach oifig poist

source: You can email the Guardian's Payment section using the secure enquiry form. For Death Benefit/Orphan's Pension:
ga: Is féidir leat ríomhphost don Rannóg íocaíocht chaomhnóra a sheoladh tríd an fhoirm fhiosraithe a úsáid

source: If you wish to talk to someone face-to-face about your entitlements, you can visit your local Citizens Information Centre, Intreo Centre or Social Welfare Branch Office
ga: Más mian leat labhairt duine-le-duine faoi do theidlíochtaí, is féidir leat cuairt a thabhairt ar d'ionad Faisnéise do Shaoránaigh áitiúil, oifig leasa shóisialaigh áitiúil nó ionad Intreo
